#include "main.h"

void Info()
{
	setlocale(LC_ALL, "RUS");

	cout << "                                           ";
	cout << "Программа выполняет 2 простых задания: " << endl<<endl;
	
	cout << "                                ";
	cout << "* Задание 1 - Сравнивает 2 введеных числа с клавиатуры;" << endl << endl;

	cout << "                                ";
	cout << "* Задание 2 - Игра горячо холодно. Отгадайте число, " << endl << "                                  " << "которое вам загадал компьютер.Дается 7 попыток;" << endl << endl;

	cout << endl;
	cout << "PS: Программа преднозначена не столько на решение задач, сколько на закрепления навыков моего внутреннего дизайнера :)." << endl;
}