#include "main.h"

void Interface(int* nu)
{
    setlocale(LC_ALL, "RUS");
    
    cout << "________________________________________________________________________________________________________________________" << endl << endl;

    cout << "                                                     ";
    cout << "Задание - 1 " << endl << endl;

    cout << "                                                     ";
    cout << "Задание - 2 " << endl << endl;

    cout << "                                                     ";
    cout << "Информация - 3" << endl << endl;

    cout << "                                                     ";
    cout << "Выход - 0" << endl << endl;

    cout << "________________________________________________________________________________________________________________________" << endl << endl;
    cout << " ";

    cin >> *nu;

}