#include "main.h"

void PrintSecond()
{
	setlocale(LC_ALL, "RUS");

	cout << "                                                  ";
	cout << "Второе задание: Medium" << endl;
	cout << "________________________________________________________________________________________________________________________" << endl;
	cout << endl;
}

void Second()
{
	setlocale(LC_ALL, "RUS");
	srand(time(NULL));
	
	int SecretNumber = rand() % 100;
	int PlayerNumber;
	int empty;

	for (int i = 0; i < 7; i++)
	{
		PrintSecond();

		cout << "                                                ";
        cout << "Число загадано, отгадывайте!" << endl << endl;

		cout << "                                                         ";
		cout << "Ваше число: " << endl;

		cout << "                                                             ";
		cin >> PlayerNumber;

		cout << endl << endl << endl << endl << endl << endl << endl << endl << endl;

		if (PlayerNumber == SecretNumber)
		{
			cout << "________________________________________________________________________________________________________________________" << endl << endl;
			cout << "                                                     ";
			cout << "Вы отгадали число!" << endl;
			cout << "________________________________________________________________________________________________________________________" << endl;

			i = 7;
		}
		else if (PlayerNumber < SecretNumber)
		{
			cout << "________________________________________________________________________________________________________________________" << endl << endl;
			cout << "                      ";
			cout << "Неверно, ваше число меньше секретного числа(Введите любое число, чобы продолжить)" << endl;
			cout << "________________________________________________________________________________________________________________________" << endl;

			cin >> empty;

			system("cls");

		}
		else if (PlayerNumber > SecretNumber)
		{
			cout << "________________________________________________________________________________________________________________________" << endl << endl;
			cout << "                      ";
			cout << "Неверно, ваше число больше секретного числа(Введите любое число, чобы продолжить)" << endl;
			cout << "________________________________________________________________________________________________________________________" << endl;

			cin >> empty;

			system("cls");
		}
		
	}

	if (PlayerNumber != SecretNumber)
	{
		cout << "________________________________________________________________________________________________________________________" << endl << endl;
		cout << "                                                   ";
		cout << "К сожалению вы проиграли" << endl;

		cout << "                                                     ";
		cout << "Секретное число это: " << endl;

		cout << "                                                             ";
		cout << SecretNumber << endl;

		cout << endl;
	}

	cout << endl;
}